In [1]:
import mysql.connector

connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="root",
    database="debi3"
)

cursor = connection.cursor()

In [2]:
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for table in tables:
    print(table)

('employee',)

In [5]:
# Insert multiple rows
employees = [
    (1, 'John Doe', 50000),
    (2, 'Jane Smith', 60000),
    (3, 'Mike Johnson', 70000)
]
cursor.executemany("INSERT INTO employee (id, name, salary) VALUES (%s, %s, %s)", employees)

In [6]:
# Select all records from a table
cursor.execute("SELECT * FROM employee")
records = cursor.fetchall()
for record in records:
    print(record)

(1, 'John Doe', None, Decimal('50000.00'))
(2, 'Jane Smith', None, Decimal('60000.00'))
(3, 'Mike Johnson', None, Decimal('70000.00'))

In [8]:
cursor.execute("SELECT * FROM employee WHERE salary >= 60000")
records = cursor.fetchall()
print(records)

[(2, 'Jane Smith', None, Decimal('60000.00')), (3, 'Mike Johnson', None, Decimal('70000.00'))]

# Comparison Operators
- = , <>

In [9]:
cursor.execute("SELECT * FROM employee WHERE salary <> 60000")
records = cursor.fetchall()
print(records)

[(1, 'John Doe', None, Decimal('50000.00')), (3, 'Mike Johnson', None, Decimal('70000.00'))]

In [10]:
cursor.execute("SELECT * FROM employee WHERE salary BETWEEN 50000 AND 70000")
records = cursor.fetchall()
print(records)

[(1, 'John Doe', None, Decimal('50000.00')), (2, 'Jane Smith', None, Decimal('60000.00')), (3, 'Mike Johnson', None, Decimal('70000.00'))]

In [11]:
cursor.execute("SELECT * FROM employee WHERE salary IN (50000, 60000)")
records = cursor.fetchall()
print(records)

[(1, 'John Doe', None, Decimal('50000.00')), (2, 'Jane Smith', None, Decimal('60000.00'))]

In [15]:
# select using ALL
cursor.execute("SELECT salary FROM employee WHERE salary = ALL (SELECT salary FROM employee WHERE name = 'Jane Smith')")
records = cursor.fetchall()
print(records)

[(Decimal('60000.00'),)]

In [16]:
# using LIKE
cursor.execute("SELECT * FROM employee WHERE name LIKE 'J%'")
records = cursor.fetchall()
print(records)

[(1, 'John Doe', None, Decimal('50000.00')), (2, 'Jane Smith', None, Decimal('60000.00'))]

In [17]:
# using LIKE
cursor.execute("SELECT * FROM employee WHERE name LIKE '_i%'")
records = cursor.fetchall()
print(records)

[(3, 'Mike Johnson', None, Decimal('70000.00'))]

Logical operators
- AND OR , NOT

In [18]:
cursor.execute("SELECT * FROM employee WHERE salary >= 60000 AND name LIKE 'J%'")
records = cursor.fetchall()
print(records)

[(2, 'Jane Smith', None, Decimal('60000.00'))]

Arithmetic Oprerations
- + , - , * , /

In [21]:
cursor.reset()

In [22]:
cursor.execute("SELECT * FROM employee WHERE salary >= 60000+1000")
records = cursor.fetchall()
print(records)

[(3, 'Mike Johnson', None, Decimal('70000.00'))]

# ORDER BY
- ASC
- DESC

In [23]:
cursor.execute("SELECT * FROM employee ORDER BY salary DESC")
records = cursor.fetchall()
print(records)

[(3, 'Mike Johnson', None, Decimal('70000.00')), (2, 'Jane Smith', None, Decimal('60000.00')), (1, 'John Doe', None, Decimal('50000.00'))]

In [24]:
cursor.execute("SELECT * FROM employee ORDER BY name ASC")
records = cursor.fetchall()
print(records)

[(2, 'Jane Smith', None, Decimal('60000.00')), (1, 'John Doe', None, Decimal('50000.00')), (3, 'Mike Johnson', None, Decimal('70000.00'))]

# Join

In [25]:
# Create tables for JOIN demonstration

# Create departments table
cursor.execute("""
CREATE TABLE IF NOT EXISTS departments (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(50),
    location VARCHAR(50)
)
""")

# Create employees table with department reference
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    salary DECIMAL(10,2),
    dept_id INT,
    hire_date DATE
)
""")

# Create projects table
cursor.execute("""
CREATE TABLE IF NOT EXISTS projects (
    project_id INT PRIMARY KEY,
    project_name VARCHAR(100),
    budget DECIMAL(12,2),
    dept_id INT
)
""")

# Create employee_projects table (many-to-many relationship)
cursor.execute("""
CREATE TABLE IF NOT EXISTS employee_projects (
    emp_id INT,
    project_id INT,
    role VARCHAR(50),
    PRIMARY KEY (emp_id, project_id)
)
""")

connection.commit()
print("Tables created successfully!")

Tables created successfully!

In [26]:
# Insert sample data into departments table
departments_data = [
    (1, 'Human Resources', 'New York'),
    (2, 'Engineering', 'San Francisco'),
    (3, 'Marketing', 'Chicago'),
    (4, 'Finance', 'New York'),
    (5, 'Research', 'Boston')
]

cursor.executemany("INSERT IGNORE INTO departments (dept_id, dept_name, location) VALUES (%s, %s, %s)", departments_data)
connection.commit()
print("Departments data inserted!")

Departments data inserted!

In [27]:
# Insert sample data into employees table
employees_data = [
    (101, 'Alice Johnson', 75000.00, 1, '2022-01-15'),
    (102, 'Bob Smith', 85000.00, 2, '2021-06-10'),
    (103, 'Charlie Brown', 65000.00, 3, '2023-03-20'),
    (104, 'Diana Prince', 90000.00, 2, '2020-09-05'),
    (105, 'Eve Adams', 70000.00, 4, '2022-11-12'),
    (106, 'Frank Miller', 95000.00, 2, '2019-04-18'),
    (107, 'Grace Lee', 60000.00, 3, '2023-07-01'),
    (108, 'Henry Wilson', 80000.00, 1, '2021-12-03'),
    (109, 'Ivy Chen', 120000.00, None, '2023-01-10')  # Employee without department
]

cursor.executemany("INSERT IGNORE INTO employees (emp_id, emp_name, salary, dept_id, hire_date) VALUES (%s, %s, %s, %s, %s)", employees_data)
connection.commit()
print("Employees data inserted!")

Employees data inserted!

In [28]:
# Insert sample data into projects table
projects_data = [
    (201, 'Website Redesign', 150000.00, 2),
    (202, 'HR System Upgrade', 80000.00, 1),
    (203, 'Marketing Campaign', 120000.00, 3),
    (204, 'Budget Analysis Tool', 95000.00, 4),
    (205, 'Mobile App Development', 200000.00, 2),
    (206, 'Data Analytics Platform', 250000.00, 5),
    (207, 'Social Media Strategy', 75000.00, 3),
    (208, 'Legacy System Migration', 300000.00, None)  # Project without assigned department
]

cursor.executemany("INSERT IGNORE INTO projects (project_id, project_name, budget, dept_id) VALUES (%s, %s, %s, %s)", projects_data)
connection.commit()
print("Projects data inserted!")

Projects data inserted!

In [29]:
# Insert sample data into employee_projects table
employee_projects_data = [
    (102, 201, 'Lead Developer'),
    (104, 201, 'Senior Developer'),
    (106, 201, 'Technical Lead'),
    (101, 202, 'Project Manager'),
    (108, 202, 'Business Analyst'),
    (103, 203, 'Marketing Specialist'),
    (107, 203, 'Content Creator'),
    (105, 204, 'Financial Analyst'),
    (102, 205, 'Mobile Developer'),
    (104, 205, 'Backend Developer'),
    (109, 206, 'Data Scientist'),
    (103, 207, 'Social Media Manager')
]

cursor.executemany("INSERT IGNORE INTO employee_projects (emp_id, project_id, role) VALUES (%s, %s, %s)", employee_projects_data)
connection.commit()
print("Employee-Projects relationships inserted!")

Employee-Projects relationships inserted!

In [30]:
# Verify the created tables and data
print("=== DEPARTMENTS ===")
cursor.execute("SELECT * FROM departments")
departments = cursor.fetchall()
for dept in departments:
    print(dept)

print("\n=== EMPLOYEES ===")
cursor.execute("SELECT * FROM employees")
employees = cursor.fetchall()
for emp in employees:
    print(emp)

print("\n=== PROJECTS ===")
cursor.execute("SELECT * FROM projects")
projects = cursor.fetchall()
for project in projects:
    print(project)

print("\n=== EMPLOYEE_PROJECTS ===")
cursor.execute("SELECT * FROM employee_projects")
emp_projects = cursor.fetchall()
for ep in emp_projects:
    print(ep)

=== DEPARTMENTS ===
(1, 'Human Resources', 'New York')
(2, 'Engineering', 'San Francisco')
(3, 'Marketing', 'Chicago')
(4, 'Finance', 'New York')
(5, 'Research', 'Boston')

=== EMPLOYEES ===
(101, 'Alice Johnson', Decimal('75000.00'), 1, datetime.date(2022, 1, 15))
(102, 'Bob Smith', Decimal('85000.00'), 2, datetime.date(2021, 6, 10))
(103, 'Charlie Brown', Decimal('65000.00'), 3, datetime.date(2023, 3, 20))
(104, 'Diana Prince', Decimal('90000.00'), 2, datetime.date(2020, 9, 5))
(105, 'Eve Adams', Decimal('70000.00'), 4, datetime.date(2022, 11, 12))
(106, 'Frank Miller', Decimal('95000.00'), 2, datetime.date(2019, 4, 18))
(107, 'Grace Lee', Decimal('60000.00'), 3, datetime.date(2023, 7, 1))
(108, 'Henry Wilson', Decimal('80000.00'), 1, datetime.date(2021, 12, 3))
(109, 'Ivy Chen', Decimal('120000.00'), None, datetime.date(2023, 1, 10))

=== PROJECTS ===
(201, 'Website Redesign', Decimal('150000.00'), 2)
(202, 'HR System Upgrade', Decimal('80000.00'), 1)
(203, 'Marketing Campaign', Decimal('120000.00'), 3)
(204, 'Budget Analysis Tool', Decimal('95000.00'), 4)
(205, 'Mobile App Development', Decimal('200000.00'), 2)
(206, 'Data Analytics Platform', Decimal('250000.00'), 5)
(207, 'Social Media Strategy', Decimal('75000.00'), 3)
(208, 'Legacy System Migration', Decimal('300000.00'), None)

=== EMPLOYEE_PROJECTS ===
(101, 202, 'Project Manager')
(102, 201, 'Lead Developer')
(102, 205, 'Mobile Developer')
(103, 203, 'Marketing Specialist')
(103, 207, 'Social Media Manager')
(104, 201, 'Senior Developer')
(104, 205, 'Backend Developer')
(105, 204, 'Financial Analyst')
(106, 201, 'Technical Lead')
(107, 203, 'Content Creator')
(108, 202, 'Business Analyst')
(109, 206, 'Data Scientist')

Inner Join

In [34]:
cursor.execute("SELECT * FROM employees, projects WHERE employees.dept_id = projects.dept_id")
records = cursor.fetchall()
for record in records:
    print(record)

(101, 'Alice Johnson', Decimal('75000.00'), 1, datetime.date(2022, 1, 15), 202, 'HR System Upgrade', Decimal('80000.00'), 1)
(102, 'Bob Smith', Decimal('85000.00'), 2, datetime.date(2021, 6, 10), 205, 'Mobile App Development', Decimal('200000.00'), 2)
(102, 'Bob Smith', Decimal('85000.00'), 2, datetime.date(2021, 6, 10), 201, 'Website Redesign', Decimal('150000.00'), 2)
(103, 'Charlie Brown', Decimal('65000.00'), 3, datetime.date(2023, 3, 20), 207, 'Social Media Strategy', Decimal('75000.00'), 3)
(103, 'Charlie Brown', Decimal('65000.00'), 3, datetime.date(2023, 3, 20), 203, 'Marketing Campaign', Decimal('120000.00'), 3)
(104, 'Diana Prince', Decimal('90000.00'), 2, datetime.date(2020, 9, 5), 205, 'Mobile App Development', Decimal('200000.00'), 2)
(104, 'Diana Prince', Decimal('90000.00'), 2, datetime.date(2020, 9, 5), 201, 'Website Redesign', Decimal('150000.00'), 2)
(105, 'Eve Adams', Decimal('70000.00'), 4, datetime.date(2022, 11, 12), 204, 'Budget Analysis Tool', Decimal('95000.00'), 4)
(106, 'Frank Miller', Decimal('95000.00'), 2, datetime.date(2019, 4, 18), 205, 'Mobile App Development', Decimal('200000.00'), 2)
(106, 'Frank Miller', Decimal('95000.00'), 2, datetime.date(2019, 4, 18), 201, 'Website Redesign', Decimal('150000.00'), 2)
(107, 'Grace Lee', Decimal('60000.00'), 3, datetime.date(2023, 7, 1), 207, 'Social Media Strategy', Decimal('75000.00'), 3)
(107, 'Grace Lee', Decimal('60000.00'), 3, datetime.date(2023, 7, 1), 203, 'Marketing Campaign', Decimal('120000.00'), 3)
(108, 'Henry Wilson', Decimal('80000.00'), 1, datetime.date(2021, 12, 3), 202, 'HR System Upgrade', Decimal('80000.00'), 1)

In [36]:
cursor.execute("SELECT * FROM employees, departments WHERE employees.dept_id = departments.dept_id")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'salary', 'dept_id', 'hire_date', 'dept_id', 'dept_name', 'location']
(101, 'Alice Johnson', Decimal('75000.00'), 1, datetime.date(2022, 1, 15), 1, 'Human Resources', 'New York')
(102, 'Bob Smith', Decimal('85000.00'), 2, datetime.date(2021, 6, 10), 2, 'Engineering', 'San Francisco')
(103, 'Charlie Brown', Decimal('65000.00'), 3, datetime.date(2023, 3, 20), 3, 'Marketing', 'Chicago')
(104, 'Diana Prince', Decimal('90000.00'), 2, datetime.date(2020, 9, 5), 2, 'Engineering', 'San Francisco')
(105, 'Eve Adams', Decimal('70000.00'), 4, datetime.date(2022, 11, 12), 4, 'Finance', 'New York')
(106, 'Frank Miller', Decimal('95000.00'), 2, datetime.date(2019, 4, 18), 2, 'Engineering', 'San Francisco')
(107, 'Grace Lee', Decimal('60000.00'), 3, datetime.date(2023, 7, 1), 3, 'Marketing', 'Chicago')
(108, 'Henry Wilson', Decimal('80000.00'), 1, datetime.date(2021, 12, 3), 1, 'Human Resources', 'New York')

In [37]:
cursor.execute("""
SELECT employees.emp_id, employees.emp_name, departments.dept_name FROM employees, departments WHERE employees.dept_id = departments.dept_id
""")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'dept_name']
(101, 'Alice Johnson', 'Human Resources')
(102, 'Bob Smith', 'Engineering')
(103, 'Charlie Brown', 'Marketing')
(104, 'Diana Prince', 'Engineering')
(105, 'Eve Adams', 'Finance')
(106, 'Frank Miller', 'Engineering')
(107, 'Grace Lee', 'Marketing')
(108, 'Henry Wilson', 'Human Resources')

Table Alias

In [39]:
cursor.execute("""
            SELECT e.emp_id, e.emp_name, d.dept_name 
            FROM employees e, departments d
            WHERE e.dept_id = d.dept_id
            ORDER BY d.dept_name
""")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'dept_name']
(102, 'Bob Smith', 'Engineering')
(104, 'Diana Prince', 'Engineering')
(106, 'Frank Miller', 'Engineering')
(105, 'Eve Adams', 'Finance')
(101, 'Alice Johnson', 'Human Resources')
(108, 'Henry Wilson', 'Human Resources')
(103, 'Charlie Brown', 'Marketing')
(107, 'Grace Lee', 'Marketing')

# Outer join
- left join
- right join
- full join

In [42]:
cursor.execute("""
            SELECT e.emp_id, e.emp_name, ep.role
            FROM employees e RIGHT OUTER JOIN employee_projects ep
            ON e.emp_id = ep.emp_id
""")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'role']
(101, 'Alice Johnson', 'Project Manager')
(102, 'Bob Smith', 'Lead Developer')
(102, 'Bob Smith', 'Mobile Developer')
(103, 'Charlie Brown', 'Marketing Specialist')
(103, 'Charlie Brown', 'Social Media Manager')
(104, 'Diana Prince', 'Senior Developer')
(104, 'Diana Prince', 'Backend Developer')
(105, 'Eve Adams', 'Financial Analyst')
(106, 'Frank Miller', 'Technical Lead')
(107, 'Grace Lee', 'Content Creator')
(108, 'Henry Wilson', 'Business Analyst')
(109, 'Ivy Chen', 'Data Scientist')

In [44]:
cursor.execute("""
            SELECT e.emp_id, e.emp_name, ep.role, p.project_name
            FROM employees e RIGHT OUTER JOIN employee_projects ep
            ON e.emp_id = ep.emp_id
            RIGHT OUTER JOIN projects p
            ON ep.project_id = p.project_id
            ORDER BY e.emp_id ASC
""")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'role', 'project_name']
(None, None, None, 'Legacy System Migration')
(101, 'Alice Johnson', 'Project Manager', 'HR System Upgrade')
(102, 'Bob Smith', 'Lead Developer', 'Website Redesign')
(102, 'Bob Smith', 'Mobile Developer', 'Mobile App Development')
(103, 'Charlie Brown', 'Marketing Specialist', 'Marketing Campaign')
(103, 'Charlie Brown', 'Social Media Manager', 'Social Media Strategy')
(104, 'Diana Prince', 'Senior Developer', 'Website Redesign')
(104, 'Diana Prince', 'Backend Developer', 'Mobile App Development')
(105, 'Eve Adams', 'Financial Analyst', 'Budget Analysis Tool')
(106, 'Frank Miller', 'Technical Lead', 'Website Redesign')
(107, 'Grace Lee', 'Content Creator', 'Marketing Campaign')
(108, 'Henry Wilson', 'Business Analyst', 'HR System Upgrade')
(109, 'Ivy Chen', 'Data Scientist', 'Data Analytics Platform')

In [46]:
cursor.execute("""
            SELECT e.emp_id, e.emp_name, ep.role, p.project_name
            FROM employees e RIGHT OUTER JOIN employee_projects ep
            ON e.emp_id = ep.emp_id
            RIGHT OUTER JOIN projects p
            ON ep.project_id = p.project_id
            WHERE p.project_name = 'Website Redesign'
            ORDER BY e.emp_id ASC
""")
#  list columns names
columns = [column[0] for column in cursor.description]
print(columns)
records = cursor.fetchall()
for record in records:
    print(record)

['emp_id', 'emp_name', 'role', 'project_name']
(102, 'Bob Smith', 'Lead Developer', 'Website Redesign')
(104, 'Diana Prince', 'Senior Developer', 'Website Redesign')
(106, 'Frank Miller', 'Technical Lead', 'Website Redesign')